1dW8/reddit_app/app/views/subs/show.html.erb

        <br>
        <%= User.find_by(id: post.author_id).username%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]