1dW8/reddit_app/app/models/user.rb

    def reset_session_token
        self.session_token = SecureRandom::base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "mvcJTPgUkcS28iL72Cyuow=="], ["updated_at", "2021-05-03 18:42:43.008919"], ["id", 1]]